openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc.c
/* Development error checking. */
static Std_ReturnType Adc_CheckReadGroup (Adc_GroupType group);
static Std_ReturnType Adc_CheckStartGroupConversion (Adc_GroupType group);
static Std_ReturnType Adc_CheckStopGroupConversion (Adc_GroupType group);
static Std_ReturnType Adc_CheckInit (const Adc_ConfigType *ConfigPtr);
#if (ADC_DEINIT_API == STD_ON)
static Std_ReturnType Adc_CheckDeInit (void);
#endif
static Std_ReturnType Adc_CheckSetupResultBuffer (Adc_GroupType group);
static Std_ReturnType Adc_CheckGetStreamLastPointer (Adc_GroupType group);

/* static variable declarations */
static Adc_StateType adcState = ADC_UNINIT;
static const Adc_ConfigType *AdcConfigPtr;      /* Pointer to configuration structure. */

/* Validate functions used for development error check */
#if ( ADC_DEV_ERROR_DETECT == STD_ON )
Std_ReturnType ValidateInit(Adc_APIServiceIDType api)
{
	Std_ReturnType res = E_OK;
	if(!(ADC_INIT == adcState)) {
		Det_ReportError(MODULE_ID_ADC,0,api,ADC_E_UNINIT );
		res = E_NOT_OK;
	}
	return res;
}
Std_ReturnType ValidateGroup(Adc_GroupType group,Adc_APIServiceIDType api)
{
	Std_ReturnType res = E_OK;
	if(!((group >= 0) && (group < AdcConfig->nbrOfGroups))) {
		Det_ReportError(MODULE_ID_ADC,0,api,ADC_E_PARAM_GROUP );
		res = E_NOT_OK;
	}
	return res;
}
#endif

#if (ADC_DEINIT_API == STD_ON)
Std_ReturnType Adc_DeInit (const Adc_ConfigType *ConfigPtr)
{
  (void)ConfigPtr;
#if defined(CFG_MPC560X)

  if (E_OK == Adc_CheckDeInit())
  {
    for(Adc_GroupType group = ADC_GROUP0; group < AdcConfigPtr->nbrOfGroups; group++)
    {
      /* Set group status to idle. */
      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;
    }

    /* Disable DMA transfer*/
#ifndef CFG_MPC5604B
    ADC_0.DMAE.B.DMAEN = 0;
#endif
    /* Power down ADC */
    ADC_0.MCR.R = 0x0001;

    /* Disable all interrupt*/
    ADC_0.IMR.R = 0;

    /* Clean internal status. */
    AdcConfigPtr = (Adc_ConfigType *)NULL;
    adcState = ADC_UNINIT;
  }

  return (E_OK);
    
#else

  Adc_eQADCQueueType queue;
  Adc_GroupType group;
  boolean queueStopped;

  if (E_OK == Adc_CheckDeInit())
  {
    /* Stop all queues. */
    for (queue = ADC_EQADC_QUEUE_0; queue < ADC_EQADC_NBR_OF_QUEUES; queue++)
    {
      /* Disable queue. */
      EQADC.CFCR[queue].B.MODE = 0;

      /* Wait for queue to enter idle state. */
      queueStopped = FALSE;
      /* TODO replace switch with bit pattern. */
      while (!queueStopped)
      {
        switch (queue)
        {
        case ADC_EQADC_QUEUE_0:
          queueStopped = (EQADC.CFSR.B.CFS0 == EQADC_CFIFO_STATUS_IDLE);
          break;
        case ADC_EQADC_QUEUE_1:
          queueStopped = (EQADC.CFSR.B.CFS1 == EQADC_CFIFO_STATUS_IDLE);
          break;
        case ADC_EQADC_QUEUE_2:
          queueStopped = (EQADC.CFSR.B.CFS2 == EQADC_CFIFO_STATUS_IDLE);
          break;
        case ADC_EQADC_QUEUE_3:
          queueStopped = (EQADC.CFSR.B.CFS3 == EQADC_CFIFO_STATUS_IDLE);
          break;
        case ADC_EQADC_QUEUE_4:
          queueStopped = (EQADC.CFSR.B.CFS4 == EQADC_CFIFO_STATUS_IDLE);
          break;
        case ADC_EQADC_QUEUE_5:
          queueStopped = (EQADC.CFSR.B.CFS5 == EQADC_CFIFO_STATUS_IDLE);
          break;
        default :
          /* We should never get here... Terminate loop. */
          queueStopped = TRUE;
          break;
        }
      }

      /* Disable eDMA requests for commands and results. */
      EQADC.IDCR[queue].B.CFFS = 0;
      EQADC.IDCR[queue].B.RFDS = 0;

      /* Disable FIFO fill requests. */
      EQADC.IDCR[queue].B.CFFE = 0;
      EQADC.IDCR[queue].B.RFDE = 0;

      /* Disable interrupts. */
      EQADC.IDCR[queue].B.RFOIE = 0;
      EQADC.IDCR[queue].B.CFUIE = 0;
      EQADC.IDCR[queue].B.TORIE = 0;
      EQADC.IDCR[queue].B.EOQIE = 0;
    }

    /* Stop all DMA channels connected to EQADC. */
    for (group = ADC_GROUP0; group < AdcConfigPtr->nbrOfGroups; group++)
    {
      Dma_StopChannel (AdcConfigPtr->groupConfigPtr [group].dmaCommandChannel);
      Dma_StopChannel (AdcConfigPtr->groupConfigPtr [group].dmaResultChannel);

      /* Set group status to idle. */
      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;
    }

    /* Disable EQADC. */
    Adc_WriteEQADCRegister (ADC0_CR, 0);

    /* Clean internal status. */
    AdcConfigPtr = (Adc_ConfigType *)NULL;
    adcState = ADC_UNINIT;
  }
  return (E_OK);
#endif /* ENDOF defined(CFG_MPC560X) */
}
#endif

Std_ReturnType Adc_Init (const Adc_ConfigType *ConfigPtr)
{
#if defined(CFG_MPC560X)

  if (E_OK == Adc_CheckInit(ConfigPtr))
  {
            /* First of all, store the location of the configuration data. */
            AdcConfigPtr = ConfigPtr;

            /* Enable ADC. */
             Adc_ConfigureADC(ConfigPtr);

             Adc_ConfigureADCInterrupts();

            /* Move on to INIT state. */
            adcState = ADC_INIT;
            return E_OK;
  }
  else
  {
    return E_NOT_OK;
  }

#else

  Std_ReturnType returnValue;
  Adc_InternalChannelIdType channel;
  Adc_InternalChannelIdType channelId;
  Adc_GroupType group;
  Adc_CommandType *commandQueue;
  Adc_CommandType command;

  if (E_OK == Adc_CheckInit(ConfigPtr))
  {
    /* First of all, store the location of the configuration data. */
    AdcConfigPtr = ConfigPtr;

    /* Start configuring the eQADC queues. */
    for (group = ADC_GROUP0; group < ConfigPtr->nbrOfGroups; group++)
    {
      /* Loop through all channels and make the command queue. */
      for (channel = 0; channel < ConfigPtr->groupConfigPtr[group].numberOfChannels; channel++)
      {
        /* Get physical channel. */
        channelId = ConfigPtr->groupConfigPtr[group].channelList[channel];

        commandQueue = ConfigPtr->groupConfigPtr[group].commandBuffer;

        /* Begin with empty command. */
        command.R = 0;

        /* Physical channel number. */
        command.B.CHANNEL_NUMBER = channelId;
        /* Sample time. */
        command.B.LST = ConfigPtr->channelConfigPtr [channel].adcChannelConvTime;
        /* Calibration feature. */
        command.B.CAL = ConfigPtr->channelConfigPtr [channel].adcChannelCalibrationEnable;
        /* Result buffer FIFO. The number of groups must not be greater than the number of queues. */
        command.B.MESSAGE_TAG = group;

        /* Write command to command queue. */
        commandQueue [channel].R = command.R;

        /* Last channel in group. Write EOQ and configure eQADC FIFO. */
        if (channel == (ConfigPtr->groupConfigPtr[group].numberOfChannels - 1))
        {
          commandQueue [channel].B.EOQ = 1;
        }
      }
    }

