openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc.c
void Adc_GroupConversionComplete (Adc_GroupType group)
{
	Adc_GroupDefType *adcGroup = (Adc_GroupDefType *)&AdcConfigPtr->groupConfigPtr[group];

  if(ADC_ACCESS_MODE_SINGLE == adcGroup->accessMode )
  {
	  adcGroup->status->groupStatus = ADC_STREAM_COMPLETED;
	  /* Call notification if enabled. */
	#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
	  if (adcGroup->status->notifictionEnable && adcGroup->groupCallback != NULL)
	  {
		  adcGroup->groupCallback();
	  }
	#endif
#if defined(CFG_MPC560X)
		  /* Disable trigger normal conversions for ADC0 */
		  ADC_0.MCR.B.NSTART=0;
#else
		  /* Disable trigger. */
		  EQADC.CFCR[group].B.MODE = 0;
#endif
  }
  else
  {
	if(ADC_STREAM_BUFFER_LINEAR == adcGroup->streamBufferMode)
	{
		adcGroup->status->currSampleCount++;
		if(adcGroup->status->currSampleCount < adcGroup->streamNumSamples)
		{
		  adcGroup->status->currResultBufPtr += adcGroup->numberOfChannels;
		  adcGroup->status->groupStatus = ADC_COMPLETED;

#if defined (ADC_USES_DMA)
		  /* Increase current result buffer ptr */
		Dma_ConfigureDestinationAddress((uint32_t)adcGroup->status->currResultBufPtr, adcGroup->dmaResultChannel);
#endif

#if defined(CFG_MPC560X)
		ADC_0.IMR.B.MSKECH = 1;
	    ADC_0.MCR.B.NSTART=1;
#else
		/* Set single scan enable bit */
		EQADC.CFCR[group].B.SSE = 1;
#endif
		}
		else
		{
		  /* All sample completed. */
		  adcGroup->status->groupStatus = ADC_STREAM_COMPLETED;

		  /* Call notification if enabled. */
		#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
		  if (adcGroup->status->notifictionEnable && adcGroup->groupCallback != NULL){
			adcGroup->groupCallback();
		  }
		#endif
#if defined(CFG_MPC560X)
		  /* Disable trigger normal conversions for ADC0 */
		  ADC_0.MCR.B.NSTART=0;
#else
		  /* Disable trigger. */
		  EQADC.CFCR[group].B.MODE = 0;
#endif
		}
	}
	else if(ADC_STREAM_BUFFER_CIRCULAR == adcGroup->streamBufferMode)
	{
		adcGroup->status->currSampleCount++;
		if(adcGroup->status->currSampleCount < adcGroup->streamNumSamples)
		{
			adcGroup->status->currResultBufPtr += adcGroup->numberOfChannels;
#if defined (ADC_USES_DMA)
			/* Increase current result buffer ptr */
			Dma_ConfigureDestinationAddress((uint32_t)adcGroup->status->currResultBufPtr, adcGroup->dmaResultChannel);
#endif
			adcGroup->status->groupStatus = ADC_COMPLETED;

#if defined(CFG_MPC560X)
			ADC_0.IMR.B.MSKECH = 1;
		    ADC_0.MCR.B.NSTART=1;
#else
			/* Set single scan enable bit */
			EQADC.CFCR[group].B.SSE = 1;
#endif
		}
		else
		{
		  /* Sample completed. */
#if defined(CFG_MPC560X)
		  /* Disable trigger normal conversions for ADC*/
		  ADC_0.MCR.B.NSTART=0;
#else
		  /* Disable trigger. */
		  EQADC.CFCR[group].B.MODE = 0;
#endif
		  adcGroup->status->groupStatus = ADC_STREAM_COMPLETED;
		  /* Call notification if enabled. */
		#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
		  if (adcGroup->status->notifictionEnable && adcGroup->groupCallback != NULL)
		  {
			  adcGroup->groupCallback();
		  }
		#endif
		}
	}
	else
	{
		//nothing to do.
	}
  }
}
#if defined(CFG_MPC560X)
void Adc_Group0ConversionComplete (void)
{
	/* Clear ECH Flag and disable interruput */
	ADC_0.ISR.B.ECH = 1;
	ADC_0.IMR.B.MSKECH = 0;

	// Check which group is busy, only one is allowed to be busy at a time in a hw unit
	for (int group = 0; group < ADC_NBR_OF_GROUPS; group++)
	{
	  if((AdcConfigPtr->groupConfigPtr[group].status->groupStatus == ADC_BUSY) ||
       (AdcConfigPtr->groupConfigPtr[group].status->groupStatus == ADC_COMPLETED))
	  {
#if !defined (ADC_USES_DMA)
		/* Copy to result buffer */
		for(uint8 index=0; index < AdcConfigPtr->groupConfigPtr[group].numberOfChannels; index++)
		{
#if defined(CFG_MPC5606S)
			AdcConfigPtr->groupConfigPtr[group].status->currResultBufPtr[index] = ADC_0.CDR[32+AdcConfigPtr->groupConfigPtr[group].channelList[index]].B.CDATA;
#else
			AdcConfigPtr->groupConfigPtr[group].status->currResultBufPtr[index] = ADC_0.CDR[AdcConfigPtr->groupConfigPtr[group].channelList[index]].B.CDATA;
#endif
		}
#endif

	    Adc_GroupConversionComplete((Adc_GroupType)group);
		break;
	  }
	}
}

void Adc_WatchdogError (void){
}
void Adc_ADCError (void){
}

static void  Adc_ConfigureADC (const Adc_ConfigType *ConfigPtr)
{
  /* Set ADC CLOCK */
  ADC_0.MCR.B.ADCLKSEL = ConfigPtr->hwConfigPtr->adcPrescale;

  ADC_0.DSDR.B.DSD = 254;

  /* Power on ADC */
  ADC_0.MCR.B.PWDN = 0;

#if defined(ADC_USES_DMA)
  /* Enable DMA. */
  ADC_0.DMAE.B.DMAEN = 1;
#endif
}

void Adc_ConfigureADCInterrupts (void)
{
	ISR_INSTALL_ISR2(  "Adc_Err", Adc_ADCError, ADC_ER_INT,     2, 0 );
	ISR_INSTALL_ISR2(  "Adc_Grp", Adc_Group0ConversionComplete, ADC_EOC_INT,     2, 0 );
	ISR_INSTALL_ISR2(  "Adc_Wdg", Adc_WatchdogError, ADC_WD_INT,     2, 0 );
}

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
void Adc_StartGroupConversion (Adc_GroupType group)
{
	Adc_GroupDefType *groupPtr = (Adc_GroupDefType *)&AdcConfigPtr->groupConfigPtr[group];

	/* Run development error check. */
	if (E_OK == Adc_CheckStartGroupConversion (group))
	{
		/* Disable trigger normal conversions for ADC0 */
		ADC_0.MCR.B.NSTART = 0;

		/* Set group state to BUSY. */
		groupPtr->status->groupStatus = ADC_BUSY;

		groupPtr->status->currSampleCount = 0;
		groupPtr->status->currResultBufPtr = groupPtr->status->resultBufferPtr; /* Set current result buffer */

#if defined(ADC_USES_DMA)
		Dma_ConfigureChannel ((Dma_TcdType *)groupPtr->groupDMAResults, groupPtr->dmaResultChannel);
		Dma_ConfigureDestinationAddress ((uint32_t)groupPtr->status->currResultBufPtr, groupPtr->dmaResultChannel);
#endif
		/* Always use single shot in streaming mode */
		if( groupPtr->accessMode == ADC_ACCESS_MODE_STREAMING)
		{
			/* Set conversion mode. */
			ADC_0.MCR.B.MODE = ADC_CONV_MODE_ONESHOT;
		}
		else
		{
			/* Set conversion mode. */
			ADC_0.MCR.B.MODE = groupPtr->conversionMode;
		}

