openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc.c
		/* Enable Overwrite*/
		ADC_0.MCR.B.OWREN = 1;

		/* Set Conversion Time. */
#if defined(CFG_MPC5606S)
		uint32 groupChannelIdMask = 0;

		ADC_0.CTR[1].B.INPLATCH = groupPtr->adcChannelConvTime.INPLATCH;
		ADC_0.CTR[1].B.INPCMP = groupPtr->adcChannelConvTime.INPCMP;
		ADC_0.CTR[1].B.INPSAMP = groupPtr->adcChannelConvTime.INPSAMP;

		for(uint8 i =0; i < groupPtr->numberOfChannels; i++)
		{
			groupChannelIdMask |= (1 << groupPtr->channelList[i]);
		}

#if defined(ADC_USES_DMA)
		ADC_0.DMAE.R = 0x01;
		/* Enable DMA Transfer */
		ADC_0.DMAR[1].R = groupChannelIdMask;
		Dma_StartChannel(DMA_ADC_GROUP0_RESULT_CHANNEL);        /* Enable EDMA channel for ADC */
#endif

		/* Enable Normal conversion */
		ADC_0.NCMR[1].R = groupChannelIdMask;

		/* Enable Channel Interrupt */
		ADC_0.CIMR[1].R = groupChannelIdMask;

#else
		uint32 groupChannelIdMask[3] = {0,0,0};

		ADC_0.CTR[0].B.INPLATCH = groupPtr->adcChannelConvTime.INPLATCH;
		ADC_0.CTR[0].B.INPCMP = groupPtr->adcChannelConvTime.INPCMP;
		ADC_0.CTR[0].B.INPSAMP = groupPtr->adcChannelConvTime.INPSAMP;
		ADC_0.CTR[1].B.INPLATCH = groupPtr->adcChannelConvTime.INPLATCH;
		ADC_0.CTR[1].B.INPCMP = groupPtr->adcChannelConvTime.INPCMP;
		ADC_0.CTR[1].B.INPSAMP = groupPtr->adcChannelConvTime.INPSAMP;
		ADC_0.CTR[2].B.INPLATCH = groupPtr->adcChannelConvTime.INPLATCH;
		ADC_0.CTR[2].B.INPCMP = groupPtr->adcChannelConvTime.INPCMP;
		ADC_0.CTR[2].B.INPSAMP = groupPtr->adcChannelConvTime.INPSAMP;

		for(uint8 i =0; i < groupPtr->numberOfChannels; i++)
		{
			if(groupPtr->channelList[i] <= 15){
				groupChannelIdMask[0] |= (1 << groupPtr->channelList[i]);
			}else if((groupPtr->channelList[i] >= 32) && (groupPtr->channelList[i] <=47)){
				groupChannelIdMask[1] |= (1 << (groupPtr->channelList[i] - 32));
			}else if((groupPtr->channelList[i] >= 64) && (groupPtr->channelList[i] <=95)){
				groupChannelIdMask[2] |= (1 << (groupPtr->channelList[i] - 64));
			}
		}

		/* Enable Normal conversion */
		ADC_0.NCMR[0].R = groupChannelIdMask[0];
		ADC_0.NCMR[1].R = groupChannelIdMask[1];
		ADC_0.NCMR[2].R = groupChannelIdMask[2];

		/* Enable Channel Interrupt */
		ADC_0.CIMR[0].R = groupChannelIdMask[0];
		ADC_0.CIMR[1].R = groupChannelIdMask[1];
		ADC_0.CIMR[2].R = groupChannelIdMask[2];
#endif
		/* Clear interrupts */
		ADC_0.ISR.B.ECH = 1;
		/* Enable ECH interrupt */
		ADC_0.IMR.B.MSKECH = 1;

		/* Trigger normal conversions for ADC0 */
		ADC_0.MCR.B.NSTART = 1;
	}
	else
	{
	/* Error have been set within Adc_CheckStartGroupConversion(). */
	}
}

void Adc_StopGroupConversion (Adc_GroupType group)
{
  if (E_OK == Adc_CheckStopGroupConversion (group))
  {
	/* Disable trigger normal conversions for ADC0 */
	ADC_0.MCR.B.NSTART = 0;

	/* Set group state to IDLE. */
	AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;

	/* Disable group notification if enabled. */
    if(1 == AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable){
    	Adc_DisableGroupNotification (group);
    }
  }
  else
  {
	/* Error have been set within Adc_CheckStartGroupConversion(). */
  }
}
#endif  /* endof #if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */

#else /* End of mpc5606s unique */

void Adc_Group0ConversionComplete (void)
{
  /* ISR for FIFO 0 end of queue. Clear interrupt flag.  */
  EQADC.FISR[ADC_EQADC_QUEUE_0].B.EOQF = 1;
  Adc_GroupConversionComplete(0);
}
void Adc_Group1ConversionComplete (void)
{
  /* ISR for FIFO 0 end of queue. Clear interrupt flag.  */
  EQADC.FISR[ADC_EQADC_QUEUE_1].B.EOQF = 1;
  Adc_GroupConversionComplete(1);
}
void Adc_Group2ConversionComplete (void)
{
  /* ISR for FIFO 0 end of queue. Clear interrupt flag.  */
  EQADC.FISR[ADC_EQADC_QUEUE_2].B.EOQF = 1;
  Adc_GroupConversionComplete(2);
}
void Adc_Group3ConversionComplete (void)
{
  /* ISR for FIFO 0 end of queue. Clear interrupt flag.  */
  EQADC.FISR[ADC_EQADC_QUEUE_3].B.EOQF = 1;
  Adc_GroupConversionComplete(3);
}
void Adc_Group4ConversionComplete (void)
{
  /* ISR for FIFO 0 end of queue. Clear interrupt flag.  */
  EQADC.FISR[ADC_EQADC_QUEUE_4].B.EOQF = 1;
  Adc_GroupConversionComplete(4);
}
void Adc_Group5ConversionComplete (void)
{
  /* ISR for FIFO 0 end of queue. Clear interrupt flag.  */
  EQADC.FISR[ADC_EQADC_QUEUE_5].B.EOQF = 1;
  Adc_GroupConversionComplete(5);
}

void Adc_EQADCError (void)
{
  /* Something is wrong!! Check the cause of the error and try to correct it. */
  if (EQADC.FISR[ADC_EQADC_QUEUE_0].B.TORF)
  {
    /* Trigger overrun on queue 0!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_1].B.TORF)
  {
    /* Trigger overrun on queue 1!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_0].B.CFUF)
  {
    /* Command underflow on queue 0!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_1].B.CFUF)
  {
    /* Command underflow on queue 1!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_0].B.RFOF)
  {
    /* Result overflow on queue 0!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_1].B.RFOF)
  {
    /* Result overflow on queue 1!! */
    assert (0);
  }
  else
  {
    /* Something else... TODO What have we missed above */
    assert(0);
  }
}

/* Helper macro to make sure that the qommand queue have
 * executed the commands in the fifo.
 * First check that the H/W negate the
 * single scan bit and then wait for EOQ. */
#define WAIT_FOR_QUEUE_TO_FINISH(q) \
  while (EQADC.FISR[q].B.SSS)             \
  {                                       \
    ;                                     \
  }                                       \
                                          \
  while (!EQADC.FISR[q].B.EOQF)           \
  {                                       \
    ;                                     \
  }

static void Adc_WriteEQADCRegister (Adc_EQADCRegisterType reg, Adc_EQADCRegister value)
{
  Adc_RegisterWriteType writeReg;
  uint32_t temp, oldMode;

